/* ================================================
■■■ 연산자(Operator) ■■■
- 비트 단위 연산자
===================================================*/

public class Test021
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;		
		
		// ~[틸드] 연산자는 비트 반전 연산자
		System.out.printf("~a : %d\n", ~a);
		System.out.printf("~b : %d\n", ~b);
	}
}

// 실행 결과

/*

a = 10 [00001010] → ~a : -11 [11110101] / why? 00001011 과 더하면 0 / 이때 00001011 은 양수 11 ∴ 11110101은 -11             

b = -10 [11110110] → ~b : 9 [00001001]

*/